#ifndef GRAPH_H
#define GRAPH_H

/*

1) Список ребер – набор пар вершин, соединенных ребрами.
2) Матрица смежности – представляет из себя квадратную матрицу, где строки и столбцы представляют вершины.
3) Набор степеней вершин – граф представляет список степеней каждой вершины, то есть количество ребер, которые к ней прилегают.
4) Список смежностей – для каждой вершины хранится список индексов вершин, с которыми она соединена.

*/


#include "graph_edge_list.h"
#include "adjacency_matrix.h"

#endif